Revit 2024 API
ExtElemChangeBeamSectionRegistry Members
The ExtElemChangeBeamSectionRegistry type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ExtElemChangeBeamSectionRegistry
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
RegisterInterface
 Registers a IExtElemChangeBeamSection
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Unregister
 Unregisters IExtElemChangeBeamSection.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExtElemChangeBeamSectionRegistry Class
Autodesk.Revit.DB.Structure Namespace